Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Please check xref:security-openid-connect-client-reference.adoc[OpenID Connect Client and Token Propagation Reference Guide] for all the information related to `Oidc Client` and `Token Propagation` support in Quarkus.
ja_jp: Quarkus の `Oidc Client` および `Token Propagation` のサポートに関する詳細は、xref:security-openid-connect-client-reference.adoc[OpenID Connect Client と Token Propagation のリファレンスガイド] を参照してください。

source: Please enable `io.quarkus.oidc.client.runtime.OidcClientImpl` `TRACE` level logging to see more details about the token acquisition and refresh errors:
ja_jp: トークンの取得および更新エラーの詳細を確認するには、 `io.quarkus.oidc.client.runtime.OidcClientImpl` `TRACE` レベルのロギングを有効にしてください。

source: Please enable `io.quarkus.oidc.client.runtime.OidcClientRecorder` `TRACE` level logging to see more details about the OidcClient initialization errors:
ja_jp: OidcClient 初期化エラーの詳細を確認するには、 `io.quarkus.oidc.client.runtime.OidcClientRecorder` `TRACE` レベルのログを有効にしてください。

source: Please enable `io.quarkus.oidc.runtime.OidcProvider` `TRACE` level logging to see more details about the token verification errors:
ja_jp: トークン検証エラーの詳細を確認するには、 `io.quarkus.oidc.runtime.OidcProvider` `TRACE` レベルのログを有効にしてください。

source: Please enable `io.quarkus.oidc.runtime.OidcRecorder` `TRACE` level logging to see more details about the OidcProvider client initialization errors:
ja_jp: OidcProvider クライアント初期化エラーの詳細を確認するには、 `io.quarkus.oidc.runtime.OidcRecorder` `TRACE` レベルのログを有効にしてください。

source: Please enable `io.quarkus.smallrye.jwt.runtime.auth.MpJwtValidator` `TRACE` level logging to see more details about the token verification or decryption errors:
ja_jp: トークンの検証または復号化エラーの詳細を確認するには、 `io.quarkus.smallrye.jwt.runtime.auth.MpJwtValidator` `TRACE` レベルのログを有効にしてください。

source: Please experiment with the default cache implementation or register a custom one.
ja_jp: デフォルトのキャッシュ実装を試すか、カスタム実装を登録してください。

source: Please follow the xref:dev-ui.adoc[Dev UI] tutorial as well as check the `extensions/oidc/deployment` sources for more ideas.
ja_jp: xref:dev-ui.adoc[Dev UI] チュートリアルと `extensions/oidc/deployment` ソースで他のアイデアも確認してください。

source: Please keep the feedback coming!
ja_jp: 引き続き、ご意見をお寄せください。

source: Please make sure that you import the microprofile `org.eclipse.microprofile.health.Startup` annotation since there is an unfortunate clash with `io.quarkus.runtime.Startup`.
ja_jp: `io.quarkus.runtime.Startup` と不幸にも衝突してしまうため、microprofile `org.eclipse.microprofile.health.Startup` のアノテーションを必ずインポートしてください。

source: Please note that code coverage is not supported in native mode.
ja_jp: ネイティブモードではコードカバレッジはサポートされていませんのでご注意ください。

source: Please note that if a JAX-RS Application has been detected and the method `getClasses()` and/or `getSingletons()` has/have been overridden, Quarkus will ignore the build time conditions and consider only what has been defined in the JAX-RS Application.
ja_jp: JAX-RS アプリケーションが検出され、メソッド `getClasses()` および、または `getSingletons()` がオーバーライドされている場合、 Quarkus はビルド時の条件を無視し、 JAX-RS アプリケーションで定義されているもののみを考慮することに注意してください。

source: Please note that if a Jakarta REST Application has been detected and the method `getClasses()` and/or `getSingletons()` has/have been overridden, Quarkus will ignore the build time conditions and consider only what has been defined in the Jakarta REST Application.
ja_jp: Jakarta REST Applicationが検出され、メソッド `getClasses()` 、 `getSingletons()` がオーバーライドされている場合、Quarkusはビルド時の条件を無視し、Jakarta REST Applicationで定義されているもののみを考慮することに注意してください。

source: Please note that if you use Elliptic Curve keys with Stork and are getting exceptions like `java.lang.ClassNotFoundException: org.bouncycastle.jce.provider.BouncyCastleProvider`, then adding a BouncyCastle PKIX dependency (`org.bouncycastle:bcpkix-jdk15on`) is required.
ja_jp: Stork で楕円曲線キーを使用すると `java.lang.ClassNotFoundException: org.bouncycastle.jce.provider.BouncyCastleProvider` のような例外が発生する場合は、BouncyCastle PKIX 依存関係 (`org.bouncycastle:bcpkix-jdk15on`) を追加する必要があります。

source: Please note that if you use Elliptic Curve keys with Stork and are getting exceptions like `java.lang.ClassNotFoundException: org.bouncycastle.jce.provider.BouncyCastleProvider`, then adding a BouncyCastle PKIX dependency (`org.bouncycastle:bcpkix-jdk18on`) is required.
ja_jp: Stork で楕円曲線キーを使用すると `java.lang.ClassNotFoundException: org.bouncycastle.jce.provider.BouncyCastleProvider` のような例外が発生する場合は、BouncyCastle PKIX 依存関係 (`org.bouncycastle:bcpkix-jdk18on`) を追加する必要があります。

source: Please note that if you would like to use Elliptic Curve keys with Kubernetes Client then adding a BouncyCastle PKIX dependency is required:
ja_jp: なお、Kubernetes Clientで楕円曲線鍵を使用したい場合は、BouncyCastle PKIXの依存関係を追加する必要があります:

source: Please note that in the case of using a client to test an exposed service that does not use TLS, there is no need to provide any configuration. E.g. to test the `HelloService` defined above, one could create the following test:
ja_jp: なお、TLS を使用していない公開サービスのテストにクライアントを使用する場合は、設定を行う必要はありませんのでご注意ください。例えば、上記で定義した `HelloService` をテストするには、次のようなテストを作成します。

source: Please note that it's using the `MutinyRedis` class which does asynchronous calls to Redis.
ja_jp: Redisへの非同期呼び出しを行う `MutinyRedis` クラスを使用していることに注目してください。

source: Please note that since the invocation is now non-blocking, the `idAsync` method will be invoked on the event loop, i.e. will not get offloaded to a worker pool thread and thus reducing hardware resource utilization. See xref:rest.adoc#execution-model[Quarkus REST execution model] for more details.
ja_jp: 呼び出しがノンブロッキングになったため、 `idAsync` メソッドがイベントループで呼び出されることに注意してください。 つまり、ワーカープールのスレッドにオフロードされないので、ハードウェアリソースの使用量を減らすことができます。 詳細は、xref:rest.adoc#execution-model[Quarkus REST 実行モデル] を参照してください。

source: Please note that since the invocation is now non-blocking, the `idAsync` method will be invoked on the event loop, i.e. will not get offloaded to a worker pool thread and thus reducing hardware resource utilization. See xref:resteasy-reactive.adoc#execution-model[Resteasy reactive execution model] for more details.
ja_jp: 呼び出しがノンブロッキングになったので、 `idAsync` メソッドがイベントループで呼び出されることに注意してください。つまり、ワーカープールのスレッドにオフロードされないので、ハードウェアリソースの使用量を減らすことができます。詳細は xref:resteasy-reactive.adoc#実行モデルブロッキング非ブロッキング[Resteasy reactive 実行モデル、ブロッキング、非ブロッキング] を参照してください。

source: Please note that since the invocation is now non-blocking, we don't need the `@Blocking` annotation anymore on the endpoint. This means that the `idAsync` method will be invoked on the event loop, i.e. will not get offloaded to a worker pool thread and thus reducing hardware resource utilization.
ja_jp: 呼び出しがノンブロッキングになったので、エンドポイントに `@Blocking` アノテーションが不要になったことに注意してください。これは、 `idAsync` メソッドがイベントループで呼び出されることを意味します。つまり、ワーカープールのスレッドにオフロードされないので、ハードウェアリソースの使用量を減らすことができます。

source: Please note that some OpenID Connect Providers will not return a refresh token in a `client_credentials` grant response. For example, starting from Keycloak 12 a refresh token will not be returned by default for `client_credentials`. The providers may also restrict a number of times a refresh token can be used.
ja_jp: 一部の OpenID Connect プロバイダーは、 `client_credentials` グラントレスポンスでリフレッシュトークンを返さない点にご注意ください。たとえば、Keycloak 12 以降、 `client_credentials` のリフレッシュトークンはデフォルトでは返されません。また、プロバイダーは、リフレッシュトークンを使用できる回数を制限する場合もあります。

source: Please note that the Spring support in Quarkus does not start a Spring Application Context nor are any Spring infrastructure classes run. Spring classes and annotations are only used for reading metadata and / or are used as user code method return types or parameter types.
ja_jp: Quarkus での Spring サポートは、Spring アプリケーションコンテキストを開始せず、Spring インフラストラクチャークラスも実行されないことに注意してください。Spring クラスとアノテーションは、メタデータの読み取りにのみ使用されるか、ユーザーコードメソッドのリターンタイプまたはパラメータータイプとして使用されます。

source: Please note that the Spring support in Quarkus does not start a Spring Application Context nor are any Spring infrastructure classes run. Spring classes and annotations are only used for reading metadata and / or are used as user code method return types or parameter types. What that means for end users, is that adding arbitrary Spring libraries will not have any effect. Moreover Spring infrastructure classes (like `org.springframework.beans.factory.config.BeanPostProcessor` , `org.springframework.context.ApplicationContext` for example) will not be executed. Regarding the dependency injection in particular, Quarkus uses a Dependency Injection mechanism (called ArC) based on the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0] specification. If you want to learn more about it we recommend you to read the xref:cdi.adoc[Quarkus introduction to CDI] and the xref:cdi-reference.adoc#arc-configuration-reference[CDI reference guide] The various Spring Boot test features are not supported by Quarkus. For testing purposes, please, check the xref:getting-started-testing.adoc[Quarkus testing guide].
ja_jp: QuarkusのSpringサポートは、Springアプリケーションコンテキストを開始せず、Springインフラストラクチャクラスも実行しないことに注意してください。 Springのクラスとアノテーションは、メタデータの読み取りにのみ使用され、ユーザーコードのメソッドの戻り値の型やパラメータの型として使用されます。 これはエンドユーザーにとって、任意のSpringライブラリを追加しても効果がないことを意味します。さらに、Springのインフラクラス(例えば `org.springframework.beans.factory.config.BeanPostProcessor` 、 `org.springframework.context.ApplicationContext` )は実行されません。 特に依存性注入に関しては、Quarkusは link:https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0] 仕様に基づいた依存性注入メカニズム（ArCと呼ばれる）を使用しています。 xref:cdi.adoc[CDIについて] 詳しく知りたい場合は、 xref:cdi.adoc[QuarkusのCDI入門と] xref:cdi-reference.adoc#arc-configuration-reference[CDIリファレンスガイド] を読むことをお勧めします。 Spring Bootのさまざまなテスト機能は、Quarkusではサポートされていません。テストについては、 xref:getting-started-testing.adoc[Quarkusのテストガイド] を参照してください。

source: Please note that the Spring support in Quarkus does not start a Spring Application Context nor are any Spring infrastructure classes run. Spring classes and annotations are only used for reading metadata and / or are used as user code method return types or parameter types. What that means for end users, is that adding arbitrary Spring libraries will not have any effect. Moreover Spring infrastructure classes (like `org.springframework.beans.factory.config.BeanPostProcessor` for example) will not be executed.
ja_jp: Quarkus での Spring サポートは、Spring Application Context を開始せず、Spring インフラストラクチャークラスも実行しないことに注意してください。Spring クラスとアノテーションは、メタデータの読み取りにのみ使用されるか、ユーザーコードメソッドの戻り値の型またはパラメーター型として使用されます。エンドユーザーにとってそれが意味することは、任意の Spring ライブラリーを追加しても効果がないということです。さらに、Spring インフラストラクチャークラス (たとえば、 `org.springframework.beans.factory.config.BeanPostProcessor` など) は実行されません。

source: Please note that the Spring support in Quarkus does not start a Spring Application Context nor are any Spring infrastructure classes run. Spring classes and annotations are only used for reading metadata and / or are used as user code method return types or parameter types. What that means for end users, is that adding arbitrary Spring libraries will not have any effect. Moreover, Spring infrastructure classes (like `org.springframework.beans.factory.config.BeanPostProcessor` , `org.springframework.context.ApplicationContext` for example) will not be executed. Regarding the dependency injection in particular, Quarkus uses a Dependency Injection mechanism (called ArC) based on the https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0] specification. If you want to learn more about it, we recommend you to read the xref:cdi.adoc[Quarkus introduction to CDI] and the xref:cdi-reference.adoc#arc-configuration-reference[CDI reference guide] The various Spring Boot test features are not supported by Quarkus. For testing purposes, please, check the xref:getting-started-testing.adoc[Quarkus testing guide].
ja_jp: QuarkusのSpringサポートは、Springアプリケーションコンテキストを開始せず、Springインフラストラクチャクラスも実行されないことに注意してください。Springクラスとアノテーションは、メタデータの読み取りと、ユーザーコードのメソッドの戻り値の型やパラメータの型として使用されるだけです。つまり、エンドユーザーにとっては、任意のSpringライブラリを追加しても、何の効果もないということです。また、Springのインフラストラクチャークラス（例えば、 `org.springframework.beans.factory.config.BeanPostProcessor` 、 `org.springframework.context.ApplicationContext` ）は、実行されません。依存性注入に関しては、Quarkusは link:https://jakarta.ee/specifications/cdi/2.0/cdi-spec-2.0.html[Contexts and Dependency Injection for Java 2.0] 仕様に基づく依存性注入メカニズム（ArCと呼ばれます）を使用しています。CDIについて詳しく知りたい場合は、 link:cdi.html[QuarkusのCDI入門] と link:cdi-reference.html#arc-configuration-reference[CDIリファレンスガイド] を読むことをお勧めします。 Spring Bootのさまざまなテスト機能は、Quarkusではサポートされていません。テスト目的であれば、 link:getting-started-testing.html[Quarkusテストガイド] をご確認ください。

source: Please note that the Spring support in Quarkus does not start a Spring Application Context nor are any Spring infrastructure classes run. Spring classes and annotations are only used for reading metadata and / or are used as user code method return types or parameter types. What that means for end users, is that adding arbitrary Spring libraries will not have any effect. Moreover, Spring infrastructure classes (like `org.springframework.beans.factory.config.BeanPostProcessor` , `org.springframework.context.ApplicationContext` for example) will not be executed. Regarding the dependency injection in particular, Quarkus uses a Dependency Injection mechanism (called ArC) based on the https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta Contexts and Dependency Injection 4.1] specification. If you want to learn more about it, we recommend you to read the xref:cdi.adoc[Quarkus introduction to CDI] and the xref:cdi-reference.adoc#arc-configuration-reference[CDI reference guide] The various Spring Boot test features are not supported by Quarkus. For testing purposes, please, check the xref:getting-started-testing.adoc[Quarkus testing guide].
ja_jp: QuarkusのSpringサポートは、Springアプリケーションコンテキストを開始せず、Springインフラストラクチャクラスも実行しないことに注意してください。 Springのクラスとアノテーションは、メタデータの読み取りにのみ使用され、ユーザーコードのメソッドの戻り値の型やパラメータの型として使用されます。 これはエンドユーザーにとって、任意のSpringライブラリを追加しても効果がないことを意味します。 さらに、Springのインフラクラス(例えば `org.springframework.beans.factory.config.BeanPostProcessor` 、 `org.springframework.context.ApplicationContext` )は実行されません。 依存性注入に関しては、Quarkusは link:https://jakarta.ee/specifications/cdi/4.1/jakarta-cdi-spec-4.1.html[Jakarta Contexts and Dependency Injection 4.1] 仕様に基づいた依存性注入メカニズム（ArCと呼ばれる）を使用しています。 xref:cdi.adoc[CDIについて] 詳しく知りたい場合は、 xref:cdi.adoc[QuarkusのCDI入門] と xref:cdi-reference.adoc#arc-configuration-reference[CDIリファレンスガイド] を読むことをお勧めします。 Spring Bootのさまざまなテスト機能は、Quarkusではサポートされていません。テストについては、 xref:getting-started-testing.adoc[Quarkusのテストガイド] を参照してください。

source: Please note that the Spring support in Quarkus does not start a Spring Application Context nor are any Spring infrastructure classes run. Spring classes and annotations are only used for reading metadata and / or are used as user code method return types or parameter types. What that means for end users, is that adding arbitrary Spring libraries will not have any effect. Moreover, Spring infrastructure classes (like `org.springframework.beans.factory.config.BeanPostProcessor` for example) will not be executed.
ja_jp: Quarkus での Spring サポートは、Spring Application Context を開始せず、Spring インフラストラクチャークラスも実行しないことに注意してください。Spring クラスとアノテーションは、メタデータの読み取りにのみ使用されるか、ユーザーコードメソッドの戻り値の型またはパラメーター型として使用されます。エンドユーザーにとってそれが意味することは、任意の Spring ライブラリーを追加しても効果がないということです。さらに、Spring インフラストラクチャークラス (たとえば、 `org.springframework.beans.factory.config.BeanPostProcessor` など) は実行されません。

source: Please note that the `exchange-token` configuration property is ignored when the OidcClient name is set with the `io.quarkus.oidc.token.propagation.AccessToken#exchangeTokenClient` annotation attribute.
ja_jp: OidcClient 名が `io.quarkus.oidc.token.propagation.AccessToken#exchangeTokenClient` アノテーション属性で設定されている場合、 `exchange-token` 設定プロパティーは無視されることに注意してください。

source: Please note that the `exchange-token` configuration property is ignored when the OidcClient name is set with the `io.quarkus.oidc.token.propagation.common.AccessToken#exchangeTokenClient` annotation attribute.
ja_jp: OidcClient 名が `io.quarkus.oidc.token.propagation.common.AccessToken#exchangeTokenClient` アノテーション属性で設定されている場合、 `exchange-token` 設定プロパティは無視されることに注意してください。

source: Please note that the `quarkus-rest-client` extension may not be used with RESTEasy Reactive, use `quarkus-rest-client-reactive` instead.
ja_jp: なお、RESTEasy Reactiveでは、 `quarkus-rest-client` エクステンションが正常に動作しない場合があります。 `quarkus-rest-client-reactive` を代わりに使用して下さい。

source: Please note that the `quarkus-resteasy-client` extension may not be used with Quarkus REST, use `quarkus-rest-client` instead.
ja_jp: `quarkus-resteasy-client` エクステンションモジュールは Quarkus REST では使用できませんので、代わりに `quarkus-rest-client` を使用してください。

source: Please note that the above command points to a floating tag. It is highly recommended to use the floating tag, so that your builder image remains up-to-date and secure. If you absolutely must, you may hard-code to a specific tag (see https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[here (UBI 8)] and https://quay.io/repository/quarkus/ubi9-quarkus-mandrel-builder-image?tab=tags[here (UBI 9)] for available tags), but be aware that you won't get security updates that way and it's unsupported.
ja_jp: 上記のコマンドはフローティング・タグを指すことに注意してください。 ビルダーイメージを最新かつ安全に保つために、フローティングタグを使用することを強く推奨します。 どうしても必要な場合は、特定のタグにハードコードすることもできます（利用可能なタグについては link:https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[ここ（UBI 8] ）と link:https://quay.io/repository/quarkus/ubi9-quarkus-mandrel-builder-image?tab=tags[ここ（UBI 9）] を参照してください）が、その方法ではセキュリティアップデートを受けることができず、サポートされていないことに注意してください。

source: Please note that the above command points to a floating tag. It is highly recommended to use the floating tag, so that your builder image remains up-to-date and secure. If you absolutely must, you may hard-code to a specific tag (see https://quay.io/repository/quarkus/ubi-quarkus-mandrel-builder-image?tab=tags[here] for available tags), but be aware that you won't get security updates that way and it's unsupported.
ja_jp: 上記のコマンドはイメージが更新されるフローティングタグを指していることに注意してください。ビルダーイメージを最新かつ安全に保つために、フローティングタグを使用することを強く推奨します。どうしても必要な場合は、特定のタグをハードコーディングしても構いませんが(利用可能なタグについては https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[こちら]を参照してください)、その方法ではセキュリティーアップデートが受けられず、サポートされていないことに注意してください。

source: Please note that the above command points to a floating tag. It is highly recommended to use the floating tag, so that your builder image remains up-to-date and secure. If you absolutely must, you may hard-code to a specific tag (see https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[here] for available tags), but be aware that you won't get security updates that way and it's unsupported.
ja_jp: 上記のコマンドはフローティングタグを指していることに注意してください。ビルダーイメージを最新かつ安全に保つために、フローティングタグを使用することを強く推奨します。どうしても必要な場合は、特定のタグをハードコーディングしても構いませんが(利用可能なタグについては https://quay.io/repository/quarkus/ubi-quarkus-mandrel?tab=tags[こちら]を参照してください)、その方法ではセキュリティーアップデートが受けられず、サポートされていないことに注意してください。

source: Please note that the password value is evaluated only once, at startup time. If `mail-password` was changed in Vault, the only way to get the new value would be to restart the application.
ja_jp: パスワードの値は、起動時に一度だけ評価されることに注意してください。Vault で `mail-password` が変更された場合、新しい値を取得するには、アプリケーションを再起動するしかありません。

source: Please note that your application needs to expose the "normal" HTTP port for the Dev UI to be accessible. If your application does not expose any HTTP endpoints, you can create a dedicated profile with a dependency on `quarkus-vertx-http`:
ja_jp: Dev UIにアクセスするには、アプリケーションが ”通常の” HTTPポートを公開する必要があることに注意してください。アプリケーションがHTTPエンドポイントを公開していない場合は、 `quarkus-vertx-http` に依存する専用のプロファイルを作成することができます。

source: Please note the general guidelines for using xref:./virtual-threads.adoc[virtual threads]
ja_jp: xref:./virtual-threads.adoc[仮想スレッド] の使用に関する一般的なガイドラインに注意してください。

source: Please read the javadoc of the `io.quarkus.qute.Qute` class for more details.
ja_jp: 詳細は `io.quarkus.qute.Qute` クラスの javadoc をお読みください。

source: Please read the xref:security-openid-connect-multitenancy.adoc[Using OpenID Connect Multi-Tenancy] guide how to support multiple tenants.
ja_jp: マルチテナントへの対応方法については、 xref:security-openid-connect-multitenancy.adoc[OpenID Connect マルチテナントの使用] ガイドをお読みください。

source: Please read the xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Applications] guide if you need to authenticate and authorize a tenant using OpenID Connect Authorization Code Flow.
ja_jp: OpenID Connect Authorization Code Flow を使用してテナントの認証と認可を行う必要がある場合は、 xref:security-openid-connect-web-authentication.adoc[OpenID Connect を使用したウェブアプリケーションの保護] ガイドをお読みください。

source: Please read the xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Applications] guide if you need to authenticate and authorize the users using OpenID Connect Authorization Code Flow.
ja_jp: OpenID Connect 認可コードフローを使用してユーザーの認証と認可を行う必要がある場合は、 xref:security-openid-connect-web-authentication.adoc[OpenID Connect を使用したウェブアプリケーションの保護] ガイドをお読みください。

source: Please read the xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide if you need to authorize a tenant using Bearer Token Authorization.
ja_jp: Bearer Token Authorization を使用してテナントを承認する必要がある場合は、xref:security-openid-connect.adoc[OpenID Connect によるサービスアプリケーションの保護] ガイドを参照してください。

source: Please read the xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide if you need to protect your applications using Bearer Token Authorization.
ja_jp: ベアラートークン認証を使用してアプリケーションを保護する必要がある場合は、xref:security-openid-connect.adoc[OpenID Connect (OIDC) を使用した、ベアラートークン認可によるサービスアプリケーションの保護] ガイドをお読みください。

source: Please refer to [JEP 514](https://openjdk.org/jeps/514) for more details.
ja_jp: 詳細は [JEP 514](https://openjdk.org/jeps/514) を参照してください。

source: Please refer to https://github.com/quarkusio/quarkus/blob/{quarkus-version}/devtools/maven/src/main/java/io/quarkus/maven/CreateExtensionMojo.java[CreateExtensionMojo JavaDoc] for all the available options of the mojo.
ja_jp: Mojo で使用できるすべてのオプションについては、 https://github.com/quarkusio/quarkus/blob/{quarkus-version}/devtools/maven/src/main/java/io/quarkus/maven/CreateExtensionMojo.java[CreateExtensionMojo JavaDoc] を参照してください。

source: Please refer to the <<jdbc-configuration,JDBC configuration reference>> for all the details about the JDBC configuration knobs.
ja_jp: JDBC 構成ノブの詳細については、<<jdbc-configuration,JDBC configuration reference>> を参照してください。

source: Please refer to the Narayana guide for details of how to exert finer grained control over the transactional behaviour of objects that implement interfaces marked with the `@Transactional` annotation.
ja_jp: `@Transactional` アノテーションでマークされたインターフェースを実装したオブジェクトのトランザクション動作をより細かく制御する方法の詳細は、Narayana を参照してください。

source: Please refer to the appropriate section depending on your context.
ja_jp: コンテキストに応じて適切なセクションを参照してください。

source: Please refer to the corresponding https://hibernate.org/repositories/[Hibernate Data Repositories] and https://jakarta.ee/specifications/data/1.0/jakarta-data-1.0[Jakarta Data] guides to learn what else they have to offer.
ja_jp: 他にどのような機能があるかについては、対応する https://hibernate.org/repositories/[Hibernate Data Repositories] および https://jakarta.ee/specifications/data/1.0/jakarta-data-1.0[Jakarta Data] ガイドを参照してください。

source: Please refer to the corresponding https://hibernate.org/repositories/[Hibernate Data Repositories] and link:{jakarta-data-spec-url}[Jakarta Data] guides to learn what else they have to offer.
ja_jp: これらの機能の詳細については、対応する https://hibernate.org/repositories/[Hibernate Data Repositories] および link:{jakarta-data-spec-url}[Jakarta Data] ガイドを参照してください。
